<a href="https://colab.research.google.com/github/poddardelhi/crm_homeTask/blob/main/HomeTask_CRMAnalyst.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [28]:
# Jovian Commit Essentials
# Please retain and execute this cell without modifying the contents for `jovian.commit` to work
!pip install jovian --upgrade -q
import jovian
jovian.set_project('crm-analyst-home-task')
jovian.set_colab_id('19qlyMoLkYQQTuyeGOT8H77D-46PRtm_K')

# Commit the work

In [42]:
#Save the work to JOVIAN.ML
project_name = "crm-analyst-home-task"
 # change this
jovian.commit(project=project_name)

[jovian] Detected Colab notebook...
[jovian] Uploading colab notebook to Jovian...
[jovian] Capturing environment..
[jovian] Committed successfully! https://jovian.ai/poddardelhi/crm-analyst-home-task

'https://jovian.ai/poddardelhi/crm-analyst-home-task'

In [3]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [5]:
# Importing the necessary libraries
import numpy as np
import pandas as pd
import pandas_profiling
import seaborn as sns
import matplotlib.pyplot as plt

%matplotlib inline

# Task 1



1. Calculate the following rates, based on data from the page "1. Data" (in the data sheet there are columns currently empty - fill them):
  
  1.1. Funnel Start Rate (Rate at which Sessions become Started Applications).
  
  1.2. Approval Rate (Rate at which Finished Applications become Approved Applications)
  
  1.3. Write Rate (Rate at which Approved Applications become Paid Applications)

In [8]:
df_application= pd.read_csv("/content/drive/MyDrive/Jovian/Ferratum_CRM/data_q1.csv")

In [9]:
df_application.head()

     Country   Date     Date_HR  ...  FinishedApps  Approved  PaidOut
0  Australia  43466  01/01/2019  ...         10587     523.0    510.0
1  Australia  43497  01/02/2019  ...          9054     546.0    537.0
2  Australia  43525  01/03/2019  ...          7614     446.0    439.0
3     Brazil  43466  01/01/2019  ...         14264    1229.0    678.0
4     Brazil  43497  01/02/2019  ...         14090     755.0    321.0

[5 rows x 8 columns]

In [12]:
df_application.shape

(66, 8)

In [16]:
#checking the Null or Nan values
df_application.isna().sum()

Country                0
Date                   0
Date_HR                0
Sessions               3
StartedApplications    3
FinishedApps           0
Approved               2
PaidOut                2
dtype: int64

In [35]:
# Finding the individual rows that are Null/NaN type
none_values=df_application[df_application.isna().any(axis=1)][::]
none_values.head()

    Country   Date     Date_HR  ...  FinishedApps  Approved  PaidOut
39  Nigeria  43466  01/01/2019  ...         92940       6.0      4.0
40  Nigeria  43497  01/02/2019  ...         70493       4.0      1.0
41  Nigeria  43525  01/03/2019  ...         60915       5.0      2.0
52   Russia  43497  01/02/2019  ...          6228       NaN      NaN
53   Russia  43525  01/03/2019  ...             0       NaN      NaN

[5 rows x 8 columns]

## Empty columns?
We have many empty columns for countries Nigeria and Russia. I'm taking a assumption here that every time a user logs in, it is recorded as 1 session. Therefore, I'm disregarding Nigeria during analysis and value 0 is replaced for all empty cells.

In case of Russia, all NaN cells are replaced with value 0

In [38]:
df_application.fillna(value=0, axis=1, inplace=True)
df_application.isna().sum()

Country                0
Date                   0
Date_HR                0
Sessions               0
StartedApplications    0
FinishedApps           0
Approved               0
PaidOut                0
dtype: int64

In [39]:
df_application.head()

     Country   Date     Date_HR  ...  FinishedApps  Approved  PaidOut
0  Australia  43466  01/01/2019  ...         10587     523.0    510.0
1  Australia  43497  01/02/2019  ...          9054     546.0    537.0
2  Australia  43525  01/03/2019  ...          7614     446.0    439.0
3     Brazil  43466  01/01/2019  ...         14264    1229.0    678.0
4     Brazil  43497  01/02/2019  ...         14090     755.0    321.0

[5 rows x 8 columns]

In [41]:
# dropping excel serial date and renaming the column Date_HR to Date
df_application.drop(labels='Date', axis=1,inplace=True)
df_application.rename(columns={'Date_HR':'Date'},inplace=True)
df_application.head()

     Country        Date  Sessions  ...  FinishedApps  Approved  PaidOut
0  Australia  01/01/2019   91127.0  ...         10587     523.0    510.0
1  Australia  01/02/2019   77586.0  ...          9054     546.0    537.0
2  Australia  01/03/2019   65420.0  ...          7614     446.0    439.0
3     Brazil  01/01/2019  232295.0  ...         14264    1229.0    678.0
4     Brazil  01/02/2019  168190.0  ...         14090     755.0    321.0

[5 rows x 7 columns]